{
    "name": "Tobias",
    "background": "background.png",
    "logo": "T_logo.png",
    "intro": {
        "title": "intro",
        "heading": "A Software Engineer With A Passion Functional Programming",
        "text": "Thank you for checking out this page about me! It was created by myself using Next.js and Tailwind CSS",
        "githubLink": "https://github.com/Tbobbe",
        "linkedInLink": "https://www.linkedin.com/in/tobias-b%C3%A4ckemo-3927491a1/",
        "mailLink": "mailto:tobias.backemo@gmail.com"
    },   
    "about": {
        "title": "about",
        "heading": "About me",
        "text": "Hi there! As you should know now after reading the headline, I am a software engineer. Naturally, programming and computers are a passion of mine, but I have more interests than just my job. I enjoy being outdoors in nature, especially I like hiking the Swedish mountains in the summer and skiing in the winter. I also have a passion for martial arts. During my young years I practiced a lot of judo and Ju-Jutsu, then later, during my studies at the university, I picked up krav maga. Other than that I enjoy what most people enjoy: A drink on the weekend, traveling on vacation, and good food.",
        "image": "profilbild_delta.png"
    },
    "education": {
        "title": "education",
        "entries": [
            {
                "heading": "Chalmers",
                "years": "2017-2022",
                "text": "I started my education at Chalmers University of Technology in the summer of 2017. Five years later, in the summer of 2022, I finished my master's thesis and left Chalmers with a bachelor's in Computer Science and Engineering and a master's degree in Algorithms, Languages, and Logic. But my time at Chalmers did not only include studying, I also took part in many student activities and was involved in multiple student commités. My time at the university was without a doubt one of the most fun parts of my life.",
                "mainImage": "chalmers_logo.svg",
                "image1": "bar.png",
                "image2": "kostym.png",
                "image3": "bar2.png"
    
            }
        ]
    },
    "experiences": {
        "title": "experience",
        "entries": [
            {
                "heading": "Intern at Ericsson",
                "years": "2020-2022",
                "text": "During my master's studies, I spent two years as an intern at Ericsson. During the summer I worked full time and the rest of the year I worked part-time. While at Ericsson I learned a lot! I gained experience in how to work in the Linux environment, I got to work with tools for the CI pipeline such as Jenkins and I got to work with both front-end, back-end, and scripting languages.",
                "logo": "Ericsson_logo.png"
            }
        ]
    },
    "languages": {
        "title": "languages",
        "entries": [
            {
                "heading": "Haskell",
                "text": "Haskell is a purely functional programming language. A lot of the functional tools one can see in modern programming languages of all paradigms originates from Haskell. For example typeclasses and monads (they are very useful once you get to know them). Since Haskell is built for functional programming and functional programming only, its syntax is very expressive and one can write code with a lot of functionality using only a few lines. Haskell is also ideal for applying a functional program architecture that yields a safe program, few bugs, and easy maintainability.",
                "logo": "haskell_logo.png"
            },
            {
                "heading": "Scala",
                "text": "Scala is a mix of an object-oriented and a functional programming language. It runs on the Java Virtual Machine which means that it can use the Java libraries. Compared to Java, however, Scala has, in my opinion, a much cleaner and more concise syntax. It also supports a lot of functional programming features such as immutable data structures.",
                "logo": "scala_logo.png"
            },
            {
                "heading": "Erlang",
                "text": "Erlang is a functional programming language that originated from Ericsson. It has one simple purpose: To be the best programming language for writing highly concurrent and fault tolerant systems. In this, I think it succeeds. The ease with which you can spawn new processes and send messages between multiple processes made me fall for Erlang. A popular programming language for backend web development, you might have heard of, called Elixir is built on top of Erlang.",
                "logo": "erlang_logo.png"
            }
        ]
    },
    "footer": {
        "githubLink": "https://github.com/Tbobbe",
        "linkedInLink": "https://www.linkedin.com/in/tobias-b%C3%A4ckemo-3927491a1/",
        "mailLink": "mailto:tobias.backemo@gmail.com"
    }

}